pdshelley/SAMD21E/libraries/Adafruit_NeoPixel/Adafruit_NeoPixel.cpp
    // In order to make this code runtime-configurable to work with any pin,
    // SBI/CBI instructions are eschewed in favor of full PORT writes via the
    // OUT or ST instructions. It relies on two facts: that peripheral
    // functions (such as PWM) take precedence on output pins, so our PORT-
    // wide writes won't interfere, and that interrupts are globally disabled
    // while data is being issued to the LEDs, so no other code will be
    // accessing the PORT. The code takes an initial 'snapshot' of the PORT
    // state, computes 'pin high' and 'pin low' values, and writes these back
    // to the PORT register as needed.

#if defined(__AVR__)
  // AVR MCUs -- ATmega & ATtiny (no XMEGA) ---------------------------------

  volatile uint16_t i = numBytes; // Loop counter
  volatile uint8_t *ptr = pixels, // Pointer to next byte
      b = *ptr++,                 // Current byte value
      hi,                         // PORT w/output bit set high
      lo;                         // PORT w/output bit set low

  // Hand-tuned assembly code issues data to the LED drivers at a specific
  // rate. There's separate code for different CPU speeds (8, 12, 16 MHz)
  // for both the WS2811 (400 KHz) and WS2812 (800 KHz) drivers. The
  // datastream timing for the LED drivers allows a little wiggle room each
  // way (listed in the datasheets), so the conditions for compiling each
  // case are set up for a range of frequencies rather than just the exact
  // 8, 12 or 16 MHz values, permitting use with some close-but-not-spot-on
  // devices (e.g. 16.5 MHz DigiSpark). The ranges were arrived at based
  // on the datasheet figures and have not been extensively tested outside
  // the canonical 8/12/16 MHz speeds; there's no guarantee these will work
  // close to the extremes (or possibly they could be pushed further).
  // Keep in mind only one CPU speed case actually gets compiled; the
  // resulting program isn't as massive as it might look from source here.

// 8 MHz(ish) AVR ---------------------------------------------------------
#if (F_CPU >= 7400000UL) && (F_CPU <= 9500000UL)

#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif

    volatile uint8_t n1, n2 = 0; // First, next bits out

    // Squeezing an 800 KHz stream out of an 8 MHz chip requires code
    // specific to each PORT register.

    // 10 instruction clocks per bit: HHxxxxxLLL
    // OUT instructions:              ^ ^    ^   (T=0,2,7)

    // PORTD OUTPUT ----------------------------------------------------

#if defined(PORTD)
#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    if (port == &PORTD) {
#endif // defined(PORTB/C/F)

      hi = PORTD | pinMask;
      lo = PORTD & ~pinMask;
      n1 = lo;
      if (b & 0x80)
        n1 = hi;

      // Dirty trick: RJMPs proceeding to the next instruction are used
      // to delay two clock cycles in one instruction word (rather than
      // using two NOPs). This was necessary in order to squeeze the
      // loop down to exactly 64 words -- the maximum possible for a
      // relative branch.

      asm volatile(
          "headD:"
          "\n\t" // Clk  Pseudocode
                 // Bit 7:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n2]   , %[lo]"
          "\n\t" // 1    n2   = lo
          "out  %[port] , %[n1]"
          "\n\t" // 1    PORT = n1
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 6"
          "\n\t" // 1-2  if(b & 0x40)
          "mov %[n2]   , %[hi]"
          "\n\t" // 0-1   n2 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 6:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n1]   , %[lo]"
          "\n\t" // 1    n1   = lo
          "out  %[port] , %[n2]"
          "\n\t" // 1    PORT = n2
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 5"
          "\n\t" // 1-2  if(b & 0x20)
          "mov %[n1]   , %[hi]"
          "\n\t" // 0-1   n1 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 5:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n2]   , %[lo]"
          "\n\t" // 1    n2   = lo
          "out  %[port] , %[n1]"
          "\n\t" // 1    PORT = n1
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 4"
          "\n\t" // 1-2  if(b & 0x10)
          "mov %[n2]   , %[hi]"
          "\n\t" // 0-1   n2 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 4:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n1]   , %[lo]"
          "\n\t" // 1    n1   = lo
          "out  %[port] , %[n2]"
          "\n\t" // 1    PORT = n2
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 3"
          "\n\t" // 1-2  if(b & 0x08)
          "mov %[n1]   , %[hi]"
          "\n\t" // 0-1   n1 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 3:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n2]   , %[lo]"
          "\n\t" // 1    n2   = lo
          "out  %[port] , %[n1]"
          "\n\t" // 1    PORT = n1
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 2"
          "\n\t" // 1-2  if(b & 0x04)
          "mov %[n2]   , %[hi]"
          "\n\t" // 0-1   n2 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 2:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n1]   , %[lo]"
          "\n\t" // 1    n1   = lo
          "out  %[port] , %[n2]"
          "\n\t" // 1    PORT = n2
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 1"
          "\n\t" // 1-2  if(b & 0x02)
          "mov %[n1]   , %[hi]"
          "\n\t" // 0-1   n1 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "rjmp .+0"
          "\n\t" // 2    nop nop
          // Bit 1:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n2]   , %[lo]"
          "\n\t" // 1    n2   = lo
          "out  %[port] , %[n1]"
          "\n\t" // 1    PORT = n1
          "rjmp .+0"
          "\n\t" // 2    nop nop
          "sbrc %[byte] , 0"
          "\n\t" // 1-2  if(b & 0x01)
          "mov %[n2]   , %[hi]"
          "\n\t" // 0-1   n2 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "sbiw %[count], 1"
          "\n\t" // 2    i-- (don't act on Z flag yet)
          // Bit 0:
          "out  %[port] , %[hi]"
          "\n\t" // 1    PORT = hi
          "mov  %[n1]   , %[lo]"
          "\n\t" // 1    n1   = lo
          "out  %[port] , %[n2]"
          "\n\t" // 1    PORT = n2
          "ld   %[byte] , %a[ptr]+"
          "\n\t" // 2    b = *ptr++
          "sbrc %[byte] , 7"
          "\n\t" // 1-2  if(b & 0x80)
          "mov %[n1]   , %[hi]"
          "\n\t" // 0-1   n1 = hi
          "out  %[port] , %[lo]"
          "\n\t" // 1    PORT = lo
          "brne headD"
          "\n" // 2    while(i) (Z flag set above)
          : [byte] "+r"(b), [n1] "+r"(n1), [n2] "+r"(n2), [count] "+w"(i)
          : [port] "I"(_SFR_IO_ADDR(PORTD)), [ptr] "e"(ptr), [hi] "r"(hi),
            [lo] "r"(lo));

