pdshelley/SAMD21E/libraries/Adafruit_NeoPixel/Adafruit_NeoPixel.cpp
#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif

    // In the 12 MHz case, an optimized 800 KHz datastream (no dead time
    // between bytes) requires a PORT-specific loop similar to the 8 MHz
    // code (but a little more relaxed in this case).

    // 15 instruction clocks per bit: HHHHxxxxxxLLLLL
    // OUT instructions:              ^   ^     ^     (T=0,4,10)

    volatile uint8_t next;

    // PORTD OUTPUT ----------------------------------------------------

#if defined(PORTD)
#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    if (port == &PORTD) {
#endif // defined(PORTB/C/F)

      hi = PORTD | pinMask;
      lo = PORTD & ~pinMask;
      next = lo;
      if (b & 0x80)
        next = hi;

      // Don't "optimize" the OUT calls into the bitTime subroutine;
      // we're exploiting the RCALL and RET as 3- and 4-cycle NOPs!
      asm volatile("headD:"
                   "\n\t" //        (T =  0)
                   "out   %[port], %[hi]"
                   "\n\t" //        (T =  1)
                   "rcall bitTimeD"
                   "\n\t" // Bit 7  (T = 15)
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 6
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 5
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 4
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 3
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 2
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeD"
                   "\n\t" // Bit 1
                   // Bit 0:
                   "out  %[port] , %[hi]"
                   "\n\t" // 1    PORT = hi    (T =  1)
                   "rjmp .+0"
                   "\n\t" // 2    nop nop      (T =  3)
                   "ld   %[byte] , %a[ptr]+"
                   "\n\t" // 2    b = *ptr++   (T =  5)
                   "out  %[port] , %[next]"
                   "\n\t" // 1    PORT = next  (T =  6)
                   "mov  %[next] , %[lo]"
                   "\n\t" // 1    next = lo    (T =  7)
                   "sbrc %[byte] , 7"
                   "\n\t" // 1-2  if(b & 0x80) (T =  8)
                   "mov %[next] , %[hi]"
                   "\n\t" // 0-1    next = hi  (T =  9)
                   "nop"
                   "\n\t" // 1                 (T = 10)
                   "out  %[port] , %[lo]"
                   "\n\t" // 1    PORT = lo    (T = 11)
                   "sbiw %[count], 1"
                   "\n\t" // 2    i--          (T = 13)
                   "brne headD"
                   "\n\t" // 2    if(i != 0) -> (next byte)
                   "rjmp doneD"
                   "\n\t"
                   "bitTimeD:"
                   "\n\t" //      nop nop nop     (T =  4)
                   "out  %[port], %[next]"
                   "\n\t" // 1    PORT = next     (T =  5)
                   "mov  %[next], %[lo]"
                   "\n\t" // 1    next = lo       (T =  6)
                   "rol  %[byte]"
                   "\n\t" // 1    b <<= 1         (T =  7)
                   "sbrc %[byte], 7"
                   "\n\t" // 1-2  if(b & 0x80)    (T =  8)
                   "mov %[next], %[hi]"
                   "\n\t" // 0-1   next = hi      (T =  9)
                   "nop"
                   "\n\t" // 1                    (T = 10)
                   "out  %[port], %[lo]"
                   "\n\t" // 1    PORT = lo       (T = 11)
                   "ret"
                   "\n\t" // 4    nop nop nop nop (T = 15)
                   "doneD:"
                   "\n"
                   : [byte] "+r"(b), [next] "+r"(next), [count] "+w"(i)
                   : [port] "I"(_SFR_IO_ADDR(PORTD)), [ptr] "e"(ptr),
                     [hi] "r"(hi), [lo] "r"(lo));

#if defined(PORTB) || defined(PORTC) || defined(PORTF)
    } else // other PORT(s)
#endif // defined(PORTB/C/F)
#endif // defined(PORTD)

    // PORTB OUTPUT ----------------------------------------------------

#if defined(PORTB)
#if defined(PORTD) || defined(PORTC) || defined(PORTF)
        if (port == &PORTB) {
#endif // defined(PORTD/C/F)

      hi = PORTB | pinMask;
      lo = PORTB & ~pinMask;
      next = lo;
      if (b & 0x80)
        next = hi;

      // Same as above, just set for PORTB & stripped of comments
      asm volatile("headB:"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeB"
                   "\n\t"
                   "out  %[port] , %[hi]"
                   "\n\t"
                   "rjmp .+0"
                   "\n\t"
                   "ld   %[byte] , %a[ptr]+"
                   "\n\t"
                   "out  %[port] , %[next]"
                   "\n\t"
                   "mov  %[next] , %[lo]"
                   "\n\t"
                   "sbrc %[byte] , 7"
                   "\n\t"
                   "mov %[next] , %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port] , %[lo]"
                   "\n\t"
                   "sbiw %[count], 1"
                   "\n\t"
                   "brne headB"
                   "\n\t"
                   "rjmp doneB"
                   "\n\t"
                   "bitTimeB:"
                   "\n\t"
                   "out  %[port], %[next]"
                   "\n\t"
                   "mov  %[next], %[lo]"
                   "\n\t"
                   "rol  %[byte]"
                   "\n\t"
                   "sbrc %[byte], 7"
                   "\n\t"
                   "mov %[next], %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port], %[lo]"
                   "\n\t"
                   "ret"
                   "\n\t"
                   "doneB:"
                   "\n"
                   : [byte] "+r"(b), [next] "+r"(next), [count] "+w"(i)
                   : [port] "I"(_SFR_IO_ADDR(PORTB)), [ptr] "e"(ptr),
                     [hi] "r"(hi), [lo] "r"(lo));

#if defined(PORTD) || defined(PORTC) || defined(PORTF)
    }
#endif
#if defined(PORTC) || defined(PORTF)
    else
#endif // defined(PORTC/F)
#endif // defined(PORTB)

    // PORTC OUTPUT ----------------------------------------------------

#if defined(PORTC)
#if defined(PORTD) || defined(PORTB) || defined(PORTF)
        if (port == &PORTC) {
#endif // defined(PORTD/B/F)

      hi = PORTC | pinMask;
      lo = PORTC & ~pinMask;
      next = lo;
      if (b & 0x80)
        next = hi;

      // Same as above, just set for PORTC & stripped of comments
      asm volatile("headC:"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out   %[port], %[hi]"
                   "\n\t"
                   "rcall bitTimeC"
                   "\n\t"
                   "out  %[port] , %[hi]"
                   "\n\t"
                   "rjmp .+0"
                   "\n\t"
                   "ld   %[byte] , %a[ptr]+"
                   "\n\t"
                   "out  %[port] , %[next]"
                   "\n\t"
                   "mov  %[next] , %[lo]"
                   "\n\t"
                   "sbrc %[byte] , 7"
                   "\n\t"
                   "mov %[next] , %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port] , %[lo]"
                   "\n\t"
                   "sbiw %[count], 1"
                   "\n\t"
                   "brne headC"
                   "\n\t"
                   "rjmp doneC"
                   "\n\t"
                   "bitTimeC:"
                   "\n\t"
                   "out  %[port], %[next]"
                   "\n\t"
                   "mov  %[next], %[lo]"
                   "\n\t"
                   "rol  %[byte]"
                   "\n\t"
                   "sbrc %[byte], 7"
                   "\n\t"
                   "mov %[next], %[hi]"
                   "\n\t"
                   "nop"
                   "\n\t"
                   "out  %[port], %[lo]"
                   "\n\t"
                   "ret"
                   "\n\t"
                   "doneC:"
                   "\n"
                   : [byte] "+r"(b), [next] "+r"(next), [count] "+w"(i)
                   : [port] "I"(_SFR_IO_ADDR(PORTC)), [ptr] "e"(ptr),
                     [hi] "r"(hi), [lo] "r"(lo));

