pdshelley/SAMD21E/libraries/Adafruit_NeoPixel/Adafruit_NeoPixel.cpp
#if defined(NEO_KHZ400) // 800 KHz check needed only if 400 KHz support enabled
  if (is800KHz) {
#endif

    // WS2811 and WS2812 have different hi/lo duty cycles; this is
    // similar but NOT an exact copy of the prior 400-on-8 code.

    // 20 inst. clocks per bit: HHHHHxxxxxxxxLLLLLLL
    // ST instructions:         ^   ^        ^       (T=0,5,13)

    volatile uint8_t next, bit;

    hi = *port | pinMask;
    lo = *port & ~pinMask;
    next = lo;
    bit = 8;

    asm volatile("head20%=:"
                 "\n\t" // Clk  Pseudocode    (T =  0)
                 "st   %a[port],  %[hi]"
                 "\n\t" // 2    PORT = hi     (T =  2)
                 "sbrc %[byte],  7"
                 "\n\t" // 1-2  if(b & 128)
                 "mov  %[next], %[hi]"
                 "\n\t" // 0-1   next = hi    (T =  4)
                 "dec  %[bit]"
                 "\n\t" // 1    bit--         (T =  5)
                 "st   %a[port],  %[next]"
                 "\n\t" // 2    PORT = next   (T =  7)
                 "mov  %[next] ,  %[lo]"
                 "\n\t" // 1    next = lo     (T =  8)
                 "breq nextbyte20%="
                 "\n\t" // 1-2  if(bit == 0) (from dec above)
                 "rol  %[byte]"
                 "\n\t" // 1    b <<= 1       (T = 10)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 12)
                 "nop"
                 "\n\t" // 1    nop           (T = 13)
                 "st   %a[port],  %[lo]"
                 "\n\t" // 2    PORT = lo     (T = 15)
                 "nop"
                 "\n\t" // 1    nop           (T = 16)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 18)
                 "rjmp head20%="
                 "\n\t" // 2    -> head20 (next bit out)
                 "nextbyte20%=:"
                 "\n\t" //                    (T = 10)
                 "ldi  %[bit]  ,  8"
                 "\n\t" // 1    bit = 8       (T = 11)
                 "ld   %[byte] ,  %a[ptr]+"
                 "\n\t" // 2    b = *ptr++    (T = 13)
                 "st   %a[port], %[lo]"
                 "\n\t" // 2    PORT = lo     (T = 15)
                 "nop"
                 "\n\t" // 1    nop           (T = 16)
                 "sbiw %[count], 1"
                 "\n\t" // 2    i--           (T = 18)
                 "brne head20%="
                 "\n" // 2    if(i != 0) -> (next byte)
                 : [port] "+e"(port), [byte] "+r"(b), [bit] "+r"(bit),
                   [next] "+r"(next), [count] "+w"(i)
                 : [ptr] "e"(ptr), [hi] "r"(hi), [lo] "r"(lo));

#if defined(NEO_KHZ400)
  } else { // 400 KHz

    // The 400 KHz clock on 16 MHz MCU is the most 'relaxed' version.

    // 40 inst. clocks per bit: HHHHHHHHxxxxxxxxxxxxLLLLLLLLLLLLLLLLLLLL
    // ST instructions:         ^       ^           ^         (T=0,8,20)

    volatile uint8_t next, bit;

    hi = *port | pinMask;
    lo = *port & ~pinMask;
    next = lo;
    bit = 8;

    asm volatile("head40%=:"
                 "\n\t" // Clk  Pseudocode    (T =  0)
                 "st   %a[port], %[hi]"
                 "\n\t" // 2    PORT = hi     (T =  2)
                 "sbrc %[byte] , 7"
                 "\n\t" // 1-2  if(b & 128)
                 "mov  %[next] , %[hi]"
                 "\n\t" // 0-1   next = hi    (T =  4)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T =  6)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T =  8)
                 "st   %a[port], %[next]"
                 "\n\t" // 2    PORT = next   (T = 10)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 12)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 14)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 16)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 18)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 20)
                 "st   %a[port], %[lo]"
                 "\n\t" // 2    PORT = lo     (T = 22)
                 "nop"
                 "\n\t" // 1    nop           (T = 23)
                 "mov  %[next] , %[lo]"
                 "\n\t" // 1    next = lo     (T = 24)
                 "dec  %[bit]"
                 "\n\t" // 1    bit--         (T = 25)
                 "breq nextbyte40%="
                 "\n\t" // 1-2  if(bit == 0)
                 "rol  %[byte]"
                 "\n\t" // 1    b <<= 1       (T = 27)
                 "nop"
                 "\n\t" // 1    nop           (T = 28)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 30)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 32)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 34)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 36)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 38)
                 "rjmp head40%="
                 "\n\t" // 2    -> head40 (next bit out)
                 "nextbyte40%=:"
                 "\n\t" //                    (T = 27)
                 "ldi  %[bit]  , 8"
                 "\n\t" // 1    bit = 8       (T = 28)
                 "ld   %[byte] , %a[ptr]+"
                 "\n\t" // 2    b = *ptr++    (T = 30)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 32)
                 "st   %a[port], %[lo]"
                 "\n\t" // 2    PORT = lo     (T = 34)
                 "rjmp .+0"
                 "\n\t" // 2    nop nop       (T = 36)
                 "sbiw %[count], 1"
                 "\n\t" // 2    i--           (T = 38)
                 "brne head40%="
                 "\n" // 1-2  if(i != 0) -> (next byte)
                 : [port] "+e"(port), [byte] "+r"(b), [bit] "+r"(bit),
                   [next] "+r"(next), [count] "+w"(i)
                 : [ptr] "e"(ptr), [hi] "r"(hi), [lo] "r"(lo));
  }
#endif // NEO_KHZ400

#else
#error "CPU SPEED NOT SUPPORTED"
#endif // end F_CPU ifdefs on __AVR__

  // END AVR ----------------------------------------------------------------

#elif defined(__arm__)

    // ARM MCUs -- Teensy 3.0, 3.1, LC, Arduino Due, RP2040 -------------------

#if defined(ARDUINO_ARCH_RP2040)
  // Use PIO
  rp2040Show(pixels, numBytes);

